Autodesk.Revit.DB.PreferredJunctionType
Since:
2013
Enumerated type representing the possible options for the preferred junction for a routine preference rule.
Since:
2013

Autodesk.Revit.DB.PreferredJunctionType.Tap
Tap junction type.

Autodesk.Revit.DB.PreferredJunctionType.Tee
Tee junction type.